# Assignment : Data Cleaning

# Importing Libraries

In [7]:
import pandas as pd
import numpy as np

## Creating the DataFrame

In [8]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm',
                               'Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

## Filling nan values in FlightNumber linearly

In [9]:
df = df.interpolate(method ='linear', limit_direction ='forward') 
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

## Separtating From_To column

In [10]:
df[['From','To']] = df.From_To.str.split("_", expand=True)
df['From'] = df['From'].str.capitalize()
df['To'] = df['To'].str.capitalize()
del df['From_To']
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

## Separating RecentDelays list elements to their own columns (separate Dataframe)

In [11]:
df1 = pd.DataFrame(df['RecentDelays'].values.tolist(),
             index=df.index).rename(columns = lambda x: 'Delay{}'.format(x+1))

## Merging the Delay Dataframe with the original DataFrame

In [12]:
df = pd.merge(df,df1,on=df.index)
del df['key_0']
del df['RecentDelays']

## Removing Special Characters and numbers from Airline column

In [13]:
df['Airline'] = df['Airline'].str.replace('\W+', '')
df['Airline'] = df['Airline'].str.replace('12', '')

## Converting all Float values to Int (ignoring nan values)

In [14]:
df['FlightNumber'] = pd.Series(df['FlightNumber'], dtype=pd.Int64Dtype())
df['Delay1'] = pd.Series(df['Delay1'], dtype=pd.Int64Dtype())
df['Delay2'] = pd.Series(df['Delay2'], dtype=pd.Int64Dtype())
df['Delay3'] = pd.Series(df['Delay3'], dtype=pd.Int64Dtype())

## Rearranging the Columns

In [15]:
df = df[['From','To','FlightNumber','Delay1','Delay2','Delay3','Airline']]

## Resultant DataFrame

In [17]:
df

       From         To  FlightNumber  Delay1  Delay2  Delay3         Airline
0    London      Paris         10045      23      47     NaN             KLM
1    Madrid      Milan         10055     NaN     NaN     NaN       AirFrance
2    London  Stockholm         10065      24      43      87  BritishAirways
3  Budapest      Paris         10075      13     NaN     NaN       AirFrance
4  Brussels     London         10085      67      32     NaN        SwissAir